cf/Documents/JobSheet.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Document>
		<Properties>
			<Name>JobSheet</Name>
			<BasedOn>
				<xr:Item>Document.ProductionOrder</xr:Item>
				<xr:Item>Document.CustomerOrder</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.JobSheets</xr:Item>
				<xr:Item>AccountingRegister.Managerial</xr:Item>
				<xr:Item>AccumulationRegister.Inventory</xr:Item>
				<xr:Item>AccumulationRegister.AccrualsAndDeductions</xr:Item>
				<xr:Item>AccumulationRegister.PayrollPayments</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>StructuralUnit</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.StructuralUnits</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Performer</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Teams</v8:Type>
						<v8:Type>cfg:CatalogRef.Employees</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DocumentCurrency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DocumentAmount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Author</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Closed</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ClosingDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Operations</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Period</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>CustomerOrder</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.CustomerOrder</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ProductsAndServices</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ProductsAndServices</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Characteristic</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ProductsAndServicesCharacteristics</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Operation</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ProductsAndServices</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>MeasurementUnit</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.UOMClassifier</v8:Type>
								<v8:Type>cfg:CatalogRef.UOM</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>QuantityPlan</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>QuantityFact</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>TimeNorm</Name>
							<Comment>Standard time for operation completion in minutes</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Tariff</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>StandardHours</Name>
							<Comment>Operation duration in minutes</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Cost</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Batch</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ProductsAndServicesBatches</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Specification</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Specifications</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>TeamMembers</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Employee</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Employees</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>LPF</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/InformationRegisters/ProductsAndServicesPrices.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ProductsAndServicesPrices</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Price</Name>
					<Comment>Price</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Actuality</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>MeasurementUnit</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.UOMClassifier</v8:Type>
						<v8:Type>cfg:CatalogRef.UOM</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Author</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>PriceKind</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.PriceKinds</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ProductsAndServices</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ProductsAndServices</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Characteristic</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ProductsAndServicesCharacteristics</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/Enums/ProductsAndServicesTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ProductsAndServicesTypes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>InventoryItem</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Service</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Work</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Operation</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>WorkKind</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DeleteExpense</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Enums/SpecificationContentRowTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>SpecificationContentRowTypes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Material</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Assembly</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Node</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Expense</Name>
					<Comment>External works and services</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Enums/OperationKindsCustomerOrder.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>OperationKindsCustomerOrder</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>OrderForSale</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OrderForProcessing</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>JobOrder</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Enums/StructuralUnitsTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>StructuralUnitsTypes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Department</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Warehouse</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Retail</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>RetailAccrualAccounting</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Enums/OperationKindsProductionOrder.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>OperationKindsProductionOrder</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Assembly</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Disassembly</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Catalogs/Teams.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Catalog>
		<Properties>
			<Name>Teams</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Content</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Employee</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Employees</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/Catalogs/ProductsAndServicesCharacteristics.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ProductsAndServicesCharacteristics</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ProductsAndServices</xr:Item>
				<xr:Item>Catalog.ProductsAndServicesCategories</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>AdditionalAttributes</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Property</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.AdditionalAttributesAndInformation</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Value</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.AdditionalAttributesAndInformation</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>TextString</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/Documents/JobSheet/Ext/ObjectModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

////////////////////////////////////////////////////////////////////////////////
// EXPORT PROCEDURES AND FUNCTIONS OF DOCUMENT

// Procedure fills team members.
//
Procedure FillTeamMembers() Export

	If ValueIsFilled(Performer) AND TypeOf(Performer) = Type("CatalogRef.Teams") Then
		
		Query = New Query;
		Query.Text = 
		"SELECT
		|	WorkgroupsContent.Employee,
		|	1 AS LPF
		|FROM
		|	Catalog.Teams.Content AS WorkgroupsContent
		|WHERE
		|	WorkgroupsContent.Ref = &Ref";
		
		Query.SetParameter("Ref", Performer);	
		
		TeamMembers.Load(Query.Execute().Unload());
		
	EndIf;	

EndProcedure

// Procedure fills tabular section according to specification.
//
Procedure FillTableBySpecification(BySpecification, ByMeasurementUnit, ByQuantity, TableContent)
	
	Query = New Query(
	"SELECT
	|	MAX(SpecificationsContent.LineNumber) AS SpecificationsContentLineNumber,
	|	SpecificationsContent.ProductsAndServices AS ProductsAndServices,
	|	SpecificationsContent.ContentRowType AS ContentRowType,
	|	CASE
	|		WHEN &UseCharacteristics
	|			THEN SpecificationsContent.Characteristic
	|		ELSE VALUE(Catalog.ProductsAndServicesCharacteristics.EmptyRef)
	|	END AS Characteristic,
	|	SpecificationsContent.Specification AS Specification,
	|	SpecificationsContent.CostPercentage AS CostPercentage,
	|	SpecificationsContent.MeasurementUnit AS MeasurementUnit,
	|	SUM(SpecificationsContent.Quantity / SpecificationsContent.ProductsQuantity * &Factor * &Quantity) AS Quantity
	|FROM
	|	Catalog.Specifications.Content AS SpecificationsContent
	|WHERE
	|	SpecificationsContent.Ref = &Specification
	|	AND SpecificationsContent.ProductsAndServices.ProductsAndServicesType = &ProductsAndServicesType
	|
	|GROUP BY
	|	SpecificationsContent.ProductsAndServices,
	|	CASE
	|		WHEN &UseCharacteristics
	|			THEN SpecificationsContent.Characteristic
	|		ELSE VALUE(Catalog.ProductsAndServicesCharacteristics.EmptyRef)
	|	END,
	|	SpecificationsContent.Specification,
	|	SpecificationsContent.MeasurementUnit,
	|	SpecificationsContent.ContentRowType,
	|	SpecificationsContent.CostPercentage
	|
	|ORDER BY
	|	SpecificationsContentLineNumber");
	
	Query.SetParameter("UseCharacteristics", Constants.FunctionalOptionUseCharacteristics.Get());
	
	Query.SetParameter("Specification", BySpecification);
	Query.SetParameter("Quantity", ByQuantity);
	
	If TypeOf(ByMeasurementUnit) = Type("CatalogRef.UOM")
		AND ValueIsFilled(ByMeasurementUnit) Then
		ByFactor = ByMeasurementUnit.Factor;
	Else
		ByFactor = 1;
	EndIf;
	Query.SetParameter("Factor", ByFactor);
	Query.SetParameter("ProductsAndServicesType", Enums.ProductsAndServicesTypes.InventoryItem);
	
	Selection = Query.Execute().Select();
	While Selection.Next() Do
		
		If Selection.ContentRowType = Enums.SpecificationContentRowTypes.Node Then
			
			FillTableBySpecification(Selection.Specification, Selection.MeasurementUnit, Selection.Quantity, TableContent);
			
		Else
			
			NewRow = TableContent.Add();
			FillPropertyValues(NewRow, Selection);
			
		EndIf;
		
	EndDo;
	
EndProcedure // FillTableBySpecification()

// Procedure for filling the document basing on Customer order.
//
Procedure FillUsingCustomerOrder(FillingData)
	
	AttributeValues = CommonUse.ObjectAttributesValues(FillingData,
			New Structure("Company, OperationKind, SalesStructuralUnit, Start, Finish, ShipmentDate"));
	
	Company = AttributeValues.Company;
	StructuralUnit = AttributeValues.SalesStructuralUnit;
	DocumentCurrency = Catalogs.PriceKinds.Accounting.PriceCurrency;
	
	If AttributeValues.OperationKind = Enums.OperationKindsCustomerOrder.JobOrder Then
		
		ClosingDate = AttributeValues.Finish;
		Period = ?(ValueIsFilled(AttributeValues.Start), AttributeValues.Start, CurrentDate());
		
		Query = New Query;
		Query.Text =
		"SELECT
		|	&Period AS Period,
		|	CustomerOrderWorks.LineNumber AS LineNumber,
		|	CustomerOrderWorks.Ref AS CustomerOrder,
		|	CustomerOrderWorks.ProductsAndServices AS ProductsAndServices,
		|	CustomerOrderWorks.Characteristic AS Characteristic,
		|	CustomerOrderWorks.Quantity AS QuantityPlan,
		|	CustomerOrderWorks.Specification AS Specification,
		|	OperationSpecification.Operation,
		|	OperationSpecification.Operation.MeasurementUnit AS MeasurementUnit,
		|	ISNULL(OperationSpecification.TimeNorm, 0) / ISNULL(OperationSpecification.ProductsQuantity, 1) AS TimeNorm,
		|	ISNULL(ProductsAndServicesPricesSliceLast.Price / ISNULL(ProductsAndServicesPricesSliceLast.MeasurementUnit.Factor, 1), 0) AS Tariff
		|FROM
		|	Document.CustomerOrder.Works AS CustomerOrderWorks
		|		LEFT JOIN Catalog.Specifications.Operations AS OperationSpecification
		|			LEFT JOIN InformationRegister.ProductsAndServicesPrices.SliceLast(&Period, PriceKind = VALUE(Catalog.PriceKinds.Accounting)) AS ProductsAndServicesPricesSliceLast
		|			ON OperationSpecification.Operation = ProductsAndServicesPricesSliceLast.ProductsAndServices
		|		ON CustomerOrderWorks.Specification = OperationSpecification.Ref
		|WHERE
		|	CustomerOrderWorks.Ref = &BasisDocument
		|	AND CustomerOrderWorks.ProductsAndServices.ProductsAndServicesType = VALUE(Enum.ProductsAndServicesTypes.Work)
		|
		|ORDER BY
		|	LineNumber";
		
	Else
		
		ClosingDate = AttributeValues.ShipmentDate;
		Period = ?(ValueIsFilled(AttributeValues.ShipmentDate), AttributeValues.ShipmentDate, CurrentDate());
		
		Query = New Query;
		Query.Text =
		"SELECT
		|	&Period AS Period,
		|	CustomerOrderInventory.LineNumber AS LineNumber,
		|	CustomerOrderInventory.Ref AS CustomerOrder,
		|	CustomerOrderInventory.ProductsAndServices AS ProductsAndServices,
		|	CustomerOrderInventory.Characteristic AS Characteristic,
		|	CustomerOrderInventory.Batch AS Batch,
		|	CustomerOrderInventory.Quantity AS QuantityPlan,
		|	CustomerOrderInventory.Specification AS Specification,
		|	OperationSpecification.Operation,
		|	OperationSpecification.Operation.MeasurementUnit AS MeasurementUnit,
		|	ISNULL(OperationSpecification.TimeNorm, 0) / ISNULL(OperationSpecification.ProductsQuantity, 1) * CASE
		|		WHEN VALUETYPE(CustomerOrderInventory.MeasurementUnit) = Type(Catalog.UOM)
		|				AND CustomerOrderInventory.MeasurementUnit <> VALUE(Catalog.UOM.EmptyRef)
		|			THEN CustomerOrderInventory.MeasurementUnit.Factor
		|		ELSE 1
		|	END AS TimeNorm,
		|	ISNULL(ProductsAndServicesPricesSliceLast.Price / ISNULL(ProductsAndServicesPricesSliceLast.MeasurementUnit.Factor, 1), 0) AS Tariff
		|FROM
		|	Document.CustomerOrder.Inventory AS CustomerOrderInventory
		|		LEFT JOIN Catalog.Specifications.Operations AS OperationSpecification
		|			LEFT JOIN InformationRegister.ProductsAndServicesPrices.SliceLast(&Period, PriceKind = VALUE(Catalog.PriceKinds.Accounting)) AS ProductsAndServicesPricesSliceLast
		|			ON OperationSpecification.Operation = ProductsAndServicesPricesSliceLast.ProductsAndServices
		|		ON CustomerOrderInventory.Specification = OperationSpecification.Ref
		|WHERE
		|	CustomerOrderInventory.Ref = &BasisDocument
		|	AND (CustomerOrderInventory.ProductsAndServices.ProductsAndServicesType = VALUE(Enum.ProductsAndServicesTypes.InventoryItem)
		|			OR CustomerOrderInventory.ProductsAndServices.ProductsAndServicesType = VALUE(Enum.ProductsAndServicesTypes.Work))
		|
		|ORDER BY
		|	LineNumber";
		
	EndIf;
	
	Query.SetParameter("BasisDocument", FillingData);
	Query.SetParameter("Period", Period);
	
	Operations.Clear();
	QueryResult = Query.Execute();
	If Not QueryResult.IsEmpty() Then
		Selection = QueryResult.Select();
		While Selection.Next() Do
			NewRow = Operations.Add();
			FillPropertyValues(NewRow, Selection);
		EndDo;
		
	EndIf
	
EndProcedure // FillByCustomerOrder()

////////////////////////////////////////////////////////////////////////////////
// EVENT HANDLERS

// IN the event handler of the FillingProcessor document
// - document filling by inventory reconciliation in the warehouse.
//
Procedure Filling(FillingData, StandardProcessing) Export
	
	If Not ValueIsFilled(FillingData) Then
		Return;
	EndIf;
	
	If TypeOf(FillingData) = Type("Structure") Then
		
		FillPropertyValues(ThisObject, FillingData);
		
		If FillingData.Property("Operations") Then
			For Each StringOperations IN FillingData.Operations Do
				NewRow = Operations.Add();
				FillPropertyValues(NewRow, StringOperations);
			EndDo;
		EndIf;
		
	ElsIf TypeOf(FillingData) = Type("DocumentRef.CustomerOrder") Then
		
		FillUsingCustomerOrder(FillingData);
		
	ElsIf TypeOf(FillingData) = Type("DocumentRef.ProductionOrder") Then
		
		If FillingData.StructuralUnit.StructuralUnitType = Enums.StructuralUnitsTypes.Warehouse Then
			
			Raise NStr("en='Job sheet can not be based on production order by warehouse!';ru='Сдельный наряд не может быть введен на основании заказа на производство по складу!'");
			
		ElsIf FillingData.OperationKind = Enums.OperationKindsProductionOrder.Assembly Then
			
			Query = New Query;
			Query.Text =
			"SELECT
			|	OrderForProductsProduction.Ref.Company AS Company,
			|	OrderForProductsProduction.Ref.StructuralUnit AS StructuralUnit,
			|	OrderForProductsProduction.Ref.Finish AS ClosingDate,
			|	&Period AS Period,
			|	OrderForProductsProduction.Ref.CustomerOrder AS CustomerOrder,
			|	OrderForProductsProduction.ProductsAndServices AS ProductsAndServices,
			|	OrderForProductsProduction.Characteristic AS Characteristic,
			|	OrderForProductsProduction.Quantity AS QuantityPlan,
			|	OrderForProductsProduction.Specification AS Specification,
			|	OperationSpecification.Operation,
			|	OperationSpecification.Operation.MeasurementUnit AS MeasurementUnit,
			|	ISNULL(OperationSpecification.TimeNorm, 0) / ISNULL(OperationSpecification.ProductsQuantity, 1) * CASE
			|		WHEN VALUETYPE(OrderForProductsProduction.MeasurementUnit) = Type(Catalog.UOM)
			|				AND OrderForProductsProduction.MeasurementUnit <> VALUE(Catalog.UOM.EmptyRef)
			|			THEN OrderForProductsProduction.MeasurementUnit.Factor
			|		ELSE 1
			|	END AS TimeNorm,
			|	ISNULL(ProductsAndServicesPricesSliceLast.Price / ISNULL(ProductsAndServicesPricesSliceLast.MeasurementUnit.Factor, 1), 0) AS Tariff
			|FROM
			|	Document.ProductionOrder.Products AS OrderForProductsProduction
			|		LEFT JOIN Catalog.Specifications.Operations AS OperationSpecification
			|			LEFT JOIN InformationRegister.ProductsAndServicesPrices.SliceLast(&Period, PriceKind = VALUE(Catalog.PriceKinds.Accounting)) AS ProductsAndServicesPricesSliceLast
			|			ON OperationSpecification.Operation = ProductsAndServicesPricesSliceLast.ProductsAndServices
			|		ON OrderForProductsProduction.Specification = OperationSpecification.Ref
			|WHERE
			|	OrderForProductsProduction.Ref = &BasisDocument";
			
			Query.SetParameter("BasisDocument", FillingData);
			Query.SetParameter("Period", ?(ValueIsFilled(FillingData.Start), FillingData.Start, CurrentDate()));
			
			QueryResult = Query.Execute();
			If Not QueryResult.IsEmpty() Then
				
				QueryResultSelection = QueryResult.Select();
				QueryResultSelection.Next();
				FillPropertyValues(ThisObject, QueryResultSelection);
				ThisObject.DocumentCurrency = Catalogs.PriceKinds.Accounting.PriceCurrency;
				
				QueryResultSelection.Reset();
				Operations.Clear();
				While QueryResultSelection.Next() Do
					NewRow = Operations.Add();
					FillPropertyValues(NewRow, QueryResultSelection);
				EndDo;
				
			EndIf
			
		Else
			
			TableContent = New ValueTable;
			
			Array = New Array;
			
			Array.Add(Type("CatalogRef.ProductsAndServices"));
			TypeDescription = New TypeDescription(Array, ,);
			Array.Clear();
			TableContent.Columns.Add("ProductsAndServices", TypeDescription);
			
			Array.Add(Type("CatalogRef.ProductsAndServicesCharacteristics"));
			TypeDescription = New TypeDescription(Array, ,);
			Array.Clear();
			TableContent.Columns.Add("Characteristic", TypeDescription);
			
			Array.Add(Type("CatalogRef.Specifications"));
			TypeDescription = New TypeDescription(Array, ,);
			Array.Clear();
			TableContent.Columns.Add("Specification", TypeDescription);
			
			Array.Add(Type("Number"));
			TypeDescription = New TypeDescription(Array, ,);
			TableContent.Columns.Add("Quantity", TypeDescription);
			
			Array.Add(Type("Number"));
			TypeDescription = New TypeDescription(Array, ,);
			TableContent.Columns.Add("CostPercentage", TypeDescription);
			
			Query = New Query;
			Query.Text =
			"SELECT
			|	&Period AS Period,
			|	OrderForProductsProduction.Ref.Company AS Company,
			|	OrderForProductsProduction.Ref.StructuralUnit AS StructuralUnit,
			|	OrderForProductsProduction.Ref.Finish AS ClosingDate,
			|	OrderForProductsProduction.Ref.CustomerOrder AS CustomerOrder,
			|	OrderForProductsProduction.ProductsAndServices AS ProductsAndServices,
			|	OrderForProductsProduction.Characteristic AS Characteristic,
			|	OrderForProductsProduction.MeasurementUnit AS MeasurementUnit,
			|	OrderForProductsProduction.Quantity AS Quantity,
			|	OrderForProductsProduction.Specification AS Specification,
			|	OperationSpecification.Operation AS Operation,
			|	OperationSpecification.Operation.MeasurementUnit AS OperationMeasurementUnit,
			|	ISNULL(OperationSpecification.TimeNorm, 0) / ISNULL(OperationSpecification.ProductsQuantity, 1) * CASE
			|		WHEN VALUETYPE(OrderForProductsProduction.MeasurementUnit) = Type(Catalog.UOM)
			|				AND OrderForProductsProduction.MeasurementUnit <> VALUE(Catalog.UOM.EmptyRef)
			|			THEN OrderForProductsProduction.MeasurementUnit.Factor
			|		ELSE 1
			|	END AS TimeNorm,
			|	ISNULL(ProductsAndServicesPricesSliceLast.Price / ISNULL(ProductsAndServicesPricesSliceLast.MeasurementUnit.Factor, 1), 0) AS Tariff
			|FROM
			|	Document.ProductionOrder.Products AS OrderForProductsProduction
			|		LEFT JOIN Catalog.Specifications.Operations AS OperationSpecification
			|			LEFT JOIN InformationRegister.ProductsAndServicesPrices.SliceLast(&Period, PriceKind = VALUE(Catalog.PriceKinds.Accounting)) AS ProductsAndServicesPricesSliceLast
			|			ON OperationSpecification.Operation = ProductsAndServicesPricesSliceLast.ProductsAndServices
			|		ON OrderForProductsProduction.Specification = OperationSpecification.Ref
			|WHERE
			|	OrderForProductsProduction.Ref = &BasisDocument";
			
			Query.SetParameter("BasisDocument", FillingData);
			Query.SetParameter("Period", ?(ValueIsFilled(FillingData.Start), FillingData.Start, CurrentDate()));
			
			QueryResult = Query.Execute();
			If Not QueryResult.IsEmpty() Then
				
				Selection = QueryResult.Select();
				Selection.Next();
				FillPropertyValues(ThisObject, Selection);
				ThisObject.DocumentCurrency = Catalogs.PriceKinds.Accounting.PriceCurrency;
				
				Selection.Reset();
				While Selection.Next() Do
					
					TableContent.Clear();
					FillTableBySpecification(Selection.Specification, Selection.MeasurementUnit, Selection.Quantity, TableContent);
					TotalCostPercentage = TableContent.Total("CostPercentage");
					
					LeftToDistribute = Selection.TimeNorm;
					
					NewRow = Undefined;
					For Each TableRow IN TableContent Do
					
						NewRow = Operations.Add();
						NewRow.Period = Selection.Period;
						NewRow.CustomerOrder = Selection.CustomerOrder;
						NewRow.ProductsAndServices = TableRow.ProductsAndServices;
						NewRow.Characteristic = TableRow.Characteristic;
						NewRow.Operation = Selection.Operation;
						NewRow.MeasurementUnit = Selection.OperationMeasurementUnit;
						NewRow.QuantityPlan = TableRow.Quantity;
						NewRow.Tariff = Selection.Tariff;
						NewRow.Specification = Selection.Specification;
						
						TimeNorm = Round(Selection.TimeNorm * TableRow.CostPercentage / ?(TotalCostPercentage = 0, 1, TotalCostPercentage),3,0);
						NewRow.TimeNorm = TimeNorm;
						LeftToDistribute = LeftToDistribute - TimeNorm;
						
					EndDo;
					
					If NewRow <> Undefined Then
						NewRow.TimeNorm = NewRow.TimeNorm + LeftToDistribute;
					EndIf;
					
				EndDo;
				
			Else
				Return;
			EndIf;
			
		EndIf;
		
	EndIf;
	
EndProcedure // FillingProcessor()

// Procedure - event handler FillCheckProcessing object.
//
Procedure FillCheckProcessing(Cancel, CheckedAttributes)
	
	If DataExchange.Load Then
	
		Return;
		
	EndIf;
	
	If Closed Then
		
		CheckedAttributes.Add("ClosingDate");
	
	EndIf;
		
EndProcedure

// Procedure - event handler BeforeWrite object.
//
Procedure BeforeWrite(Cancel, WriteMode, PostingMode)
	
	If DataExchange.Load Then
		Return;
	EndIf;

	DocumentAmount = Operations.Total("Cost");
	
EndProcedure // BeforeWrite()

// Procedure - event handler FillingProcessor object.
//
Procedure Posting(Cancel, PostingMode)

	// Initialization of additional properties for document posting
	SmallBusinessServer.InitializeAdditionalPropertiesForPosting(Ref, AdditionalProperties);
	
	// Initialization of document data
	Documents.JobSheet.InitializeDocumentData(Ref, AdditionalProperties);
	
	// Preparation of record sets
	SmallBusinessServer.PrepareRecordSetsForRecording(ThisObject);
	
	// Registering in accounting sections
	SmallBusinessServer.ReflectAccrualsAndDeductions(AdditionalProperties, RegisterRecords, Cancel);
	SmallBusinessServer.ReflectPayrollPayments(AdditionalProperties, RegisterRecords, Cancel);
	SmallBusinessServer.ReflectInventory(AdditionalProperties, RegisterRecords, Cancel);
	SmallBusinessServer.ReflectJobSheets(AdditionalProperties, RegisterRecords, Cancel);
	SmallBusinessServer.ReflectManagerial(AdditionalProperties, RegisterRecords, Cancel);

	// Writing of record sets
	SmallBusinessServer.WriteRecordSets(ThisObject);
	
	AdditionalProperties.ForPosting.StructureTemporaryTables.TempTablesManager.Close();
	
EndProcedure // Posting()

// Procedure - event handler UndoPosting object.
//
Procedure UndoPosting(Cancel)

	// Initialization of additional properties for document posting
	SmallBusinessServer.InitializeAdditionalPropertiesForPosting(Ref, AdditionalProperties);
	
	// Preparation of record sets
	SmallBusinessServer.PrepareRecordSetsForRecording(ThisObject);
	
	// Writing of record sets
	SmallBusinessServer.WriteRecordSets(ThisObject);
	
EndProcedure // UndoPosting()

#EndIf
